# SQL

### Selecting

syntax :-
**SELECT** column1,column2,... **from** NameOfTable **WHERE** conditions ;

### Count

* returns the number of rows that match the query criteria
* syntax :- <br>
SELECT COUNT(*) from NameOfTable;   returns total no of rows<br>
SELECT COUNT(NameOfColumn) from NameOfTable WHERE NameOfColumn=condition;   returns number of rows where the condition is satisfied


### Distinct 
* this is similar to the .unique() method in pandas where it returns the number of unique entries in a given column
* syntax :- <br>
SELECT DISTINCT NameOfColumn from NameOfTable; returns no of unique entries in the column<br>
SELECT DISTINCT NameOfColumn from NameOfTable WHERE NameOfColumn= condition: returns unique entries that satisfy condition


### Limit
* this is similar to the .head() function in python
* syntax :- <br>
SELECT * from NameOfTable LIMIT 10;  returns just top 10 rows<br>
* OFFSET 10 means start from the 11th index

### Insert
* used to populate an existing TABLE <br>
* syntax :- <br>
**INSERT INTO** NameOfTable <br> (Column1,Column2,...) **VALUES** <br>('Value1', 'Value2',...)<br>
* we can also populate multiple rows at once as displayed here in the example :- <br>

**INSERT INTO** NameOfTable <br>(Column1,Column2,...)<br> **VALUES**<br> ('Value1', 'Value2',...)<br> ('Value11', 'Value22',...)

### Update
* after populating a table, we can alter its data using the UPDATE command
* syntax :-<br>
**UPDATE** NameOfTable **SET** Column1='Value1' Column2='Value2' **WHERE** Column3 = Condition<br>


### Delete
* to delete rows using some conditions
* syntax :-<br>
**DELETE** from NameOfTable **WHERE** Column1=Condition<br>

### DDL vs DML

* Data Definition Lang vs Data Manipulation Lang
* DDL :-
1. CREATE (creating tables and defining columns)
2. ALTER (adding and modifying columns)
3. TRUNCATE (deleting data in the table but not the table itself)
4. DROP (deleting tables)<br>

* DML:- 
1. INSERT (Inserting a row(s) into an existing table)
2. SELECT (reads rows from a table)
3. UPDATE (edits rows in a table)
4. DELETE (deletes rows from a table)

### Create
* syntax:- <br>
CREATE TABLE NameOfTable<br>
    (<br>
        NameOfColumn1 dataType optionalParameter,<br>
        NameOfColumn2 dataType optionalParameter,<br>
        NameOfColumn3 dataType optionalParameter,<br>
        NameOfColumn4 dataType optionalParameter,<br>
        .<br>
        .<br>
      <br>  
    )
* char(n) is a character string of fixed length n
* varchar(n) is a character string of variable length upto n characters
* we assign some column the optional parameter of **PRIMARY KEY**. this implies that no duplicate entries in that particular column can exist and it uniquely identifies its rows
* **NOT NULL** is an optional parameter that specifies that this column in a row of info cant be NaN

### Alter
* Used to modify existing columns 
* or add or remove columns from the table
* syntax :- <br>
ALTER TABLE NameOfTable<br>
    ADD COLUMN NameOfNewColumn1 dataType<br>
    ADD COLUMN NameOfNewColumn2 dataType<br>
    ADD COLUMN NameOfNewColumn3 dataType<br>
    MODIFY NameOfColumn newDataType<br>
    DROP COLUMN NameOfColumn;

### Drop
* DROP TABLE NameOfTable;

### Truncate 
* deletes all the rows in the table
* TRUNCATE TABLE NameOfTable <br> IMMEDIATE;

### String Pattern
* when the "condition" in the WHERE Statement isnt clearly defined we use "**like**"
* example :- <br>
SELECT FirstName from Author<br>
WHERE FirstName **like** 'R%'<br> *this returns those rows in which the FirstName starts with an R*

* for range we can use the "**between--and--**" function
* similarly we can use "**in--list**" function

### Sorting Result Sets
* we use the **ORDER BY** function for this
* for example :- <br>
SELECT * from Book<br>
ORDER BY Title<br> *this is will display all the books sorted alphabetically by their Title in ascending order*
* for example :- <br>
SELECT * from Book<br>
ORDER BY Title DESC<br> *this is will display all the books sorted alphabetically by their Title in descending order*

### Grouping Result Sets
* we use the "**GROUP BY**" clause for this
* example :- <br>
SELECT Country,COUNT(Country) from Author<br>
GROUP BY Country<br> *this will display the count of each country against its name*
* we use the **HAVING** clause with the GROUP BY clause to filter the results

### Built-in Functions
* Aggregate Functions : SUM(), MIN(), MAX(), AVG(),etc<br>
example = SELECT SUM(NameOfColumn) as NameOfNewColumn from NameOfTable;
* Scalar/String Functions : ROUND(), LENGTH(), UCASE, LCASE
* Date & Time Functions : 
1. SQL has DATE,TIME and TIMESTAMP datatypes
2. the functions include YEAR(), MONTH(), DAY(), DAYOFMONTH(), DAYOFWEEK(), DAYOFYEAR(), WEEK(), HOUR(), MINUTE(), SECOND()
3. syntax :- <br> SELECT YEAR(NameOfDateColumn) from NameOfTable WHERE Condition;
4. there are special functions for Date & Time arithmetic and have special registers for that
5. these special functions are DATE_ADD, DATE_SUB, DATEDIFF

### Nested-Selects and Sub-Queries
* example of a sub-query is <br>
SELECT Column1 from NameOfTable<br>
WHERE Column2 = (SELECT MAX(Column2) from NameOfTable)